package lesson6;

/**
 * Создать массив типа double с размером 4.
 * Записать в него любые значения с помощью блока для инициализации.
 * Вывести на консоль значение первого элемента.
 */

public class NewElement {
    public static void main(String[] args) {
        double[] element = {0.33, 7.89, 17.69, -3.789};
        System.out.print(element[0]);
    }
}
