package Lesson5;

/**
 * Переписать гирлянду используя оператор switch для  выбора  нужной операции.
 * Имеется гирлянда, состоящая из 32 лампочек. Каждая лампочка имеет два состояния - включена или выключена. В начале работы программы случайным образом задайте какие лампочки будут включены. Напишите следующие методы:
 * a) метод который будет мигать лампочками гирлянды заданное количество раз (операция ~);
 * б) метод, который будет запускать гирлянду в режим бегущей строки (операция << или >>);
 * в) метод, который будет выяснять включена ли лампочки на первой позиции (наложение маски с помощью &);
 * г) метод который будет распечатывать текущее состояние гирлянды.
 * Используйте побитовые операции. Для получения двоичного формата числа используйте метод Integer.toBinaryString(a).
 */
/*
public class SwitchGarland {
    public static void main(String[] args) {
        lamp = 15;
        operation(lamp);
    }

    public static void operation(int a) {
        switch (a) {
            case a = ~a:
                System.out.println(Integer.toBinaryString(a));
                break;
            case a >> 1:
                System.out.println(Integer.toBinaryString(a));
                break;
            case a & 1:
                System.out.println(Integer.toBinaryString(a));
                break;
        }
    }
}
*/
