package lesson14;

/**
 * Напишите метод, заменяющий в строке все вхождения «object oriented programming»(не учитываем регистр символов) на «OOP».
 */
/*
public class OOPphrase {
    public static void main(String[] args) {
        String s = "Object Oriented proGRAMMing klgsng slggkm lsmlkdgm smgkmgklm lerokglm object oriented programming fdblmk dmgkgm";
        System.out.println(changeTo());
    }

    static void changeTo(String s) {

    }
}
*/
